In [26]:
import pandas as pd
import datetime as dt
from pandas.tseries.offsets import DateOffset

In [2]:
pd.Timestamp(year=2000,month=4,day=4)

Timestamp('2000-04-04 00:00:00')

In [3]:
dt.datetime(year=2000,month=4,day=4)

datetime.datetime(2000, 4, 4, 0, 0)

In [4]:
pd.Timestamp(year=2000,month=4,day=4) == dt.datetime(year=2000,month=4,day=4)

True

In [6]:
pd.Timestamp(ts_input = '2000/4/4')

Timestamp('2000-04-04 00:00:00')

In [7]:
pd.Timestamp(ts_input = '2000-4-4')

Timestamp('2000-04-04 00:00:00')

In [9]:
pd.Timestamp(ts_input = '4/28/2000 8:50:34')

Timestamp('2000-04-28 08:50:34')

In [10]:
pd.Timestamp(ts_input = '4/28/2000 8:50:34 PM')

Timestamp('2000-04-28 20:50:34')

In [11]:
pd.Timestamp(ts_input = dt.datetime(2000,4,29,8,50,34))

Timestamp('2000-04-29 08:50:34')

In [12]:
pt = pd.Timestamp(ts_input = dt.datetime(2000,4,29,8,50,34))

In [13]:
print(pt.year)
print(pt.month)
print(pt.day)
print(pt.hour)
print(pt.minute)
print(pt.second)

2000
4
29
8
50
34

In [14]:
timestamps = [
    pd.Timestamp('2000-4-1'),
    pd.Timestamp('2000-4-2'),
    pd.Timestamp('2000-4-3')
]

pd.Series(['saleh', 'reza', 'hasan'])

0    saleh
1     reza
2    hasan
dtype: object

In [15]:
pd.Series(['saleh', 'reza', 'hasan'], index=timestamps)

2000-04-01    saleh
2000-04-02     reza
2000-04-03    hasan
dtype: object

In [16]:
morning = pd.Timestamp('2020-05-18 11:33:20 AM')
evening = pd.Timestamp('2020-05-18 11:33:20 PM')

morning < evening

True

In [17]:
disney = pd.read_csv('data/disney.csv', parse_dates=['Date'])
disney

            Date        High         Low        Open       Close
0     1962-01-02    0.096026    0.092908    0.092908    0.092908
1     1962-01-03    0.094467    0.092908    0.092908    0.094155
2     1962-01-04    0.094467    0.093532    0.094155    0.094155
3     1962-01-05    0.094779    0.093844    0.094155    0.094467
4     1962-01-08    0.095714    0.092285    0.094467    0.094155
...          ...         ...         ...         ...         ...
14722 2020-06-26  111.199997  108.019997  110.949997  109.099998
14723 2020-06-29  111.570000  108.099998  109.000000  111.519997
14724 2020-06-30  112.050003  109.930000  111.500000  111.510002
14725 2020-07-01  115.599998  112.290001  112.820000  113.010002
14726 2020-07-02  115.099998  112.000000  115.000000  112.180000

[14727 rows x 5 columns]

In [18]:
disney['Date'].dt.year

0        1962
1        1962
2        1962
3        1962
4        1962
         ...
14722    2020
14723    2020
14724    2020
14725    2020
14726    2020
Name: Date, Length: 14727, dtype: int64

In [20]:
disney['Date'].dt.day

0         2
1         3
2         4
3         5
4         8
         ..
14722    26
14723    29
14724    30
14725     1
14726     2
Name: Date, Length: 14727, dtype: int64

In [23]:
disney['Date'].dt.day_name()

0          Tuesday
1        Wednesday
2         Thursday
3           Friday
4           Monday
           ...
14722       Friday
14723       Monday
14724      Tuesday
14725    Wednesday
14726     Thursday
Name: Date, Length: 14727, dtype: object

In [21]:
disney['Date'].dt.dayofweek

0        1
1        2
2        3
3        4
4        0
        ..
14722    4
14723    0
14724    1
14725    2
14726    3
Name: Date, Length: 14727, dtype: int64

In [25]:
disney['week_day'] = disney['Date'].dt.day_name()
g = disney.groupby('week_day')
g.mean(numeric_only=True)

                High        Low       Open      Close
week_day
Friday     23.767304  23.318898  23.552872  23.554498
Monday     23.377271  22.930606  23.161392  23.162543
Thursday   23.770234  23.288687  23.534561  23.540359
Tuesday    23.791234  23.335267  23.571755  23.562907
Wednesday  23.842743  23.355419  23.605618  23.609873

In [27]:
disney['Date']

0       1962-01-02
1       1962-01-03
2       1962-01-04
3       1962-01-05
4       1962-01-08
           ...
14722   2020-06-26
14723   2020-06-29
14724   2020-06-30
14725   2020-07-01
14726   2020-07-02
Name: Date, Length: 14727, dtype: datetime64[ns]

In [28]:
disney['Date'] + DateOffset(days=5)

0       1962-01-07
1       1962-01-08
2       1962-01-09
3       1962-01-10
4       1962-01-13
           ...
14722   2020-07-01
14723   2020-07-04
14724   2020-07-05
14725   2020-07-06
14726   2020-07-07
Name: Date, Length: 14727, dtype: datetime64[ns]

In [29]:
disney['Date'] - DateOffset(days=5, hours=8)

0       1961-12-27 16:00:00
1       1961-12-28 16:00:00
2       1961-12-29 16:00:00
3       1961-12-30 16:00:00
4       1962-01-02 16:00:00
                ...
14722   2020-06-20 16:00:00
14723   2020-06-23 16:00:00
14724   2020-06-24 16:00:00
14725   2020-06-25 16:00:00
14726   2020-06-26 16:00:00
Name: Date, Length: 14727, dtype: datetime64[ns]

### TiemDelta

In [30]:
pd.Timedelta(days=8, hours=7, minutes=6, seconds=5)

Timedelta('8 days 07:06:05')

In [31]:
pd.to_timedelta('3 hours, 5 minutes, 12 seconds')

Timedelta('0 days 03:05:12')

In [32]:
pd.to_timedelta([5, 8, 12], unit='days')

TimedeltaIndex(['5 days', '8 days', '12 days'], dtype='timedelta64[ns]', freq=None)

In [35]:
pd.Timestamp('2000-04-04') - pd.Timestamp('1998-5-24')

Timedelta('681 days 00:00:00')

In [37]:
dlv = pd.read_csv('data/deliveries.csv', parse_dates=['order_date', 'delivery_date'])
dlv

    order_date delivery_date
0   1998-05-24    1999-02-05
1   1992-04-22    1998-03-06
2   1991-02-10    1992-08-26
3   1992-07-21    1997-11-20
4   1993-09-02    1998-06-10
..         ...           ...
496 1991-06-24    1996-02-02
497 1991-09-09    1998-03-30
498 1990-11-16    1998-04-27
499 1993-06-03    1993-06-13
500 1990-01-04    1991-10-03

[501 rows x 2 columns]

In [38]:
dlv['delivery_date'] - dlv['order_date']

0      257 days
1     2144 days
2      563 days
3     1948 days
4     1742 days
         ...
496   1684 days
497   2394 days
498   2719 days
499     10 days
500    637 days
Length: 501, dtype: timedelta64[ns]

In [39]:
dlv['duration'] = dlv['delivery_date'] - dlv['order_date']
dlv

    order_date delivery_date  duration
0   1998-05-24    1999-02-05  257 days
1   1992-04-22    1998-03-06 2144 days
2   1991-02-10    1992-08-26  563 days
3   1992-07-21    1997-11-20 1948 days
4   1993-09-02    1998-06-10 1742 days
..         ...           ...       ...
496 1991-06-24    1996-02-02 1684 days
497 1991-09-09    1998-03-30 2394 days
498 1990-11-16    1998-04-27 2719 days
499 1993-06-03    1993-06-13   10 days
500 1990-01-04    1991-10-03  637 days

[501 rows x 3 columns]

In [40]:
dlv.sort_values('duration')

    order_date delivery_date  duration
454 1990-05-24    1990-06-01    8 days
294 1994-08-11    1994-08-20    9 days
10  1998-05-10    1998-05-19    9 days
499 1993-06-03    1993-06-13   10 days
143 1997-09-20    1997-10-06   16 days
..         ...           ...       ...
152 1990-09-18    1999-12-19 3379 days
62  1990-04-02    1999-08-16 3423 days
458 1990-02-13    1999-11-15 3562 days
145 1990-03-07    1999-12-25 3580 days
448 1990-01-20    1999-11-12 3583 days

[501 rows x 3 columns]

In [41]:
dlv['duration'].mean()

Timedelta('1217 days 22:53:53.532934128')

In [43]:
dlv[dlv['duration'] > pd.Timedelta(days=365)]

    order_date delivery_date  duration
1   1992-04-22    1998-03-06 2144 days
2   1991-02-10    1992-08-26  563 days
3   1992-07-21    1997-11-20 1948 days
4   1993-09-02    1998-06-10 1742 days
6   1990-01-25    1994-10-02 1711 days
..         ...           ...       ...
495 1990-12-10    1992-12-16  737 days
496 1991-06-24    1996-02-02 1684 days
497 1991-09-09    1998-03-30 2394 days
498 1990-11-16    1998-04-27 2719 days
500 1990-01-04    1991-10-03  637 days

[394 rows x 3 columns]

In [44]:
dlv[dlv['duration'] > '365 days']

    order_date delivery_date  duration
1   1992-04-22    1998-03-06 2144 days
2   1991-02-10    1992-08-26  563 days
3   1992-07-21    1997-11-20 1948 days
4   1993-09-02    1998-06-10 1742 days
6   1990-01-25    1994-10-02 1711 days
..         ...           ...       ...
495 1990-12-10    1992-12-16  737 days
496 1991-06-24    1996-02-02 1684 days
497 1991-09-09    1998-03-30 2394 days
498 1990-11-16    1998-04-27 2719 days
500 1990-01-04    1991-10-03  637 days

[394 rows x 3 columns]